# 1
# კარგი პრაქტიკები ნიშნავს ისეთ წესების დაცვას რომელიც დაგვეხმარება კოდი უფრო კარგაად ვისწავლოთ და გავიგოთ.


# 2
age = 5
age1 = (age + 9)
print(age1)


# 3
# პითონში მნიშვნელოვანია დიდი და პატარა ზომის სწორედ გამოყენება რადგან თითოეული სხვადასხვა რამეს გამოიტანს მაგალითად:
number = 5   
NUMBER = 6
NumbeR = 7
print(number)
print(NUMBER)
print(NumbeR)
#  ეს ყველა სხვადასხვა რამეს გამოიტანს.


# 4
number1 = 10
number2 = 5
task = number1 * number2
print(task)


# 5
# 7634 რომ გავყოთ 4 ზე ნაშთი 2 იქნება
# 982 რომ გავყოთ 3 ზე ნაშთი 1 იქნება
# 12345 რომ გავყოთ 3 ზე ნაშთი 0 იქნება


# 6
# ეს კოდი გამოიტანს giorgi და nika გამოიტანს


# 7
age = 23
print(age) # პატარა ასოთი უნდა იყოს Age - age
num = (34)
print(num + 5) # არასწორია რადგან num = "34" და ეს integer-ია