# 1
# algorithm - არის კონკრეტული თანმიმდევრობით დაწერილი ნაბიჯები რაიმე დავალებისთის.
# control flow - არის წესები, რომლის მეშვეობითაც ვნახავთ რომელი კოდის როდის შესრულდება.


# 2
# % - გამოიტანს ნაშთს
print(5 % 2)
# ეს გამოიტანს 1 რადგან ნაშთი 1 არის

print(10%4)
# ეს გამოიტანს 2 რადგან ნაშთი 2 დარჩება.

# // - ეს არის გაყოფა ოღონდ ისე რომ მთელი არი იყოს მაგალითად 5 // 2 ზე გამოიტანს 2.
print(10 // 2)
# გამოიტანს 5 და არა 5.0
print(20 // 6)
# გამოიტანს 3 და არა 3.0


# 3
1.
number = 14    
name = "ლაშა"  
result = (number > 15) and (name == "ლაშა")
print(result)  

2.
number = 18    
name = "ლაშა"  
result = (number > 15) and (name == "ლაშა")
print(result)  


# 4
age = int(input("შეიყვანეთ თქვენი ასაკი: "))
name = input("შეიყვანეთ თქვენი სახელი: ")
door_open = (age > 18) or (name == "Andrew")
print("შეგიძლიათ შემოხვიდეთ" * ((age > 18) or (name == "Andrew")) or "ვერ შეხვალთ")


# 5
num = 17
print(num>18 or 2>1) # გამოიტანს True

age = 18
# print(Age >= 18 and 10==10) # გამოიტანს error რადგან არ არის Age ცვლადი  შექმნილი

random = "saba"
print("saba"==random or 17%2==0) # გამოიტანს True