# 1
# ცვლადი არის იგივე ყუთი რომელსაც აქვს სახელი და შიგნით რაღაც მონაცემია მოთავსებული


# 2
# food=("shaurma")
# print(food)


# 3
# print(10)  # ეს მთელი რიცხვი(integer)
# print(4.5) # ეს არის ათწილადი(float)

# 4
name = " ლაშა ტერტერაშვილი "
print(name)


# 5
name = "ლაშა"
surname = "ტერტერაშვილი"
print(name + " " +  surname)


# 6
print("house" *  3 ) # გამოიტანა 3-ჯერ house რადგან 3ჯერ გავამრავლეთ house.


# 7
#print('this is string")   #რო გავასწოროდ უნდ ადავწეროთ ესე  print("this is string") ან ესე print('this is string')
#surname : "ტერტერაშვილი" რომ გავასწოროთ უნდა დავწეროთ ტოლობა(=)  surname = "ტერტერაშვილი" 
# car = mercedes არასწორია რადგან ბრჭყალებიც უნდა car = "mercedes"


# 8
# ტერმინალში "math" იმიტო არ გამოდის რო როცა ბრჭყალებს იყენებ, პროგრამა ხედავს ტექსტს 
# როცა არ იყენებ ბრჭყალებს მაშინ ცვლადს ხედავს.